IDEA Open Model
CrossSectionFactory.FillSteelTI Method
Compatible with IDEA StatiCa Beta 20.0
 Fill steel T profile made from part of I profile
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillSteelTI(
	CrossSectionParameter cssO,
	string name,
	double H
)
Public Shared Sub FillSteelTI (
	cssO As CrossSectionParameter,
	name As String,
	H As Double
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name
Type: System.String
Name
H
Type: System.Double
Height
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace